# Exercise 2-2: Write your own code for the Mortality Notebook

In [1]:
import pandas as pd

## Get the long and wide DataFrames

In [2]:
mortality_data = pd.read_csv('mortality.csv')

In [3]:
pd.to_pickle(mortality_data, "mortality_data.pkl")

In [4]:
mortality_data = pd.read_pickle('mortality_data.pkl')
mortality_data.head()

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [5]:
pd.to_pickle(mortality_data, "mortality_wide.pkl")

In [6]:
mortality_wide = pd.read_pickle('mortality_wide.pkl')
mortality_wide.head()

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

## Work with the wide DataFrame

In [7]:
mortality_wide.head(5)

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5

In [8]:
mortality_wide.columns = mortality_wide.columns.str.replace(" ", "")

In [9]:
mortality_wide.columns

Index(['Year', 'AgeGroup', 'DeathRate'], dtype='object')

In [10]:
mortality_wide.rename(columns={'DeathRate':'Deaths/100K'},inplace=True)

In [11]:
mortality_wide.columns

Index(['Year', 'AgeGroup', 'Deaths/100K'], dtype='object')

In [12]:
mortality_wide['MeanCentered'] = \
    mortality_wide.Year - mortality_wide.Year.mean()

In [14]:
mortality_wide.head(5)

   Year   AgeGroup  Deaths/100K  MeanCentered
0  1900  1-4 Years       1983.8         -59.0
1  1901  1-4 Years       1695.0         -58.0
2  1902  1-4 Years       1655.7         -57.0
3  1903  1-4 Years       1542.1         -56.0
4  1904  1-4 Years       1591.5         -55.0

In [15]:
mortality_wide.sort_values('Year', inplace=True)

In [16]:
mortality_wide.head(5)

     Year     AgeGroup  Deaths/100K  MeanCentered
0    1900    1-4 Years       1983.8         -59.0
357  1900  15-19 Years        484.8         -59.0
238  1900  10-14 Years        298.3         -59.0
119  1900    5-9 Years        466.1         -59.0
358  1901  15-19 Years        454.4         -58.0

In [17]:
mortality_wide.query('Year == 1915 or Year == 1916 or Year == 1917 or Year == 1918 or Year == 1919 or Year == 1920').tail(6)

     Year     AgeGroup  Deaths/100K  MeanCentered
257  1919  10-14 Years        236.4         -40.0
19   1919    1-4 Years        928.0         -40.0
139  1920    5-9 Years        295.2         -39.0
377  1920  15-19 Years        402.9         -39.0
20   1920    1-4 Years        987.2         -39.0
258  1920  10-14 Years        229.9         -39.0

In [18]:
mortality_wide.query('AgeGroup == "1-4 Years"')[['Year','Deaths/100K']]

     Year  Deaths/100K
0    1900       1983.8
1    1901       1695.0
2    1902       1655.7
3    1903       1542.1
4    1904       1591.5
..    ...          ...
114  2014         24.0
115  2015         24.9
116  2016         25.3
117  2017         24.3
118  2018         24.0

[119 rows x 2 columns]

In [27]:
mortality_wide.sort_values('Deaths/100K', ascending=False).tail(3)

     Year   AgeGroup  Deaths/100K  MeanCentered
233  2014  5-9 Years         11.5          55.0
229  2010  5-9 Years         11.5          51.0
231  2012  5-9 Years         11.4          53.0

In [28]:
mortality_wide.sort_values('Deaths/100K', ascending=False).loc[[0,233,229,231]]

     Year   AgeGroup  Deaths/100K  MeanCentered
0    1900  1-4 Years       1983.8         -59.0
233  2014  5-9 Years         11.5          55.0
229  2010  5-9 Years         11.5          51.0
231  2012  5-9 Years         11.4          53.0

In [35]:
mortality_wide['Deaths/100K'].median()

89.5

In [37]:
mortality_wide['Deaths/100K'].mean()

192.92415966386574

In [41]:
mortality_wide.groupby('Year').sum()

      Deaths/100K  MeanCentered
Year
1900       3233.0        -236.0
1901       2850.6        -232.0
1902       2733.0        -228.0
1903       2659.1        -224.0
1904       2793.1        -220.0
...           ...           ...
2014         95.0         220.0
2015         99.5         224.0
2016        103.3         228.0
2017        102.9         232.0
2018         99.6         236.0

[119 rows x 2 columns]

In [47]:
mortality_wide.index

Int64Index([  0, 357, 238, 119, 358, 120, 239,   1,   2, 359,
            ...
            116, 235, 355, 474, 236, 117, 237, 118, 356, 475],
           dtype='int64', length=476)

In [48]:
mortality_wide.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 476 entries, 0 to 475
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Year          476 non-null    int64
 1   AgeGroup      476 non-null    object
 2   Deaths/100K   476 non-null    float64
 3   MeanCentered  476 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 18.6+ KB

In [49]:
mortality_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        476 non-null    int64
 1   Age Group   476 non-null    object
 2   Death Rate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ KB

In [51]:
mortality_wide.describe()

              Year  Deaths/100K  MeanCentered
count   476.000000   476.000000    476.000000
mean   1959.000000   192.924160      0.000000
std      34.387268   293.224216     34.387268
min    1900.000000    11.400000    -59.000000
25%    1929.000000    40.575000    -30.000000
50%    1959.000000    89.500000      0.000000
75%    1989.000000   222.575000     30.000000
max    2018.000000  1983.800000     59.000000

In [52]:
mortality_wide.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,476.0,1959.00000,34.387268,1900.0,1929.000,1959.0,1989.000,2018.0
Deaths/100K,476.0,192.92416,293.224216,11.4,40.575,89.5,222.575,1983.8
MeanCentered,476.0,0.00000,34.387268,-59.0,-30.000,0.0,30.000,59.0

In [58]:
mortality_wide.query('AgeGroup == "1-4 Years"')[['Year','AgeGroup']].head()

   Year   AgeGroup
0  1900  1-4 Years
1  1901  1-4 Years
2  1902  1-4 Years
3  1903  1-4 Years
4  1904  1-4 Years

In [82]:
mortality_wide.sort_values('AgeGroup', inplace=True)

In [83]:
mortality_wide

     Year   AgeGroup  Deaths/100K  MeanCentered
0    1900  1-4 Years       1983.8         -59.0
26   1926  1-4 Years        723.4         -33.0
78   1978  1-4 Years         67.9          19.0
27   1927  1-4 Years        591.0         -32.0
77   1977  1-4 Years         67.6          18.0
..    ...        ...          ...           ...
135  1916  5-9 Years        282.4         -43.0
184  1965  5-9 Years         43.9           6.0
213  1994  5-9 Years         19.7          35.0
211  1992  5-9 Years         20.3          33.0
132  1913  5-9 Years        317.7         -46.0

[476 rows x 4 columns]

In [85]:
mortality_wide.query('Year == 1915')

     Year     AgeGroup  Deaths/100K  MeanCentered
15   1915    1-4 Years        924.2         -44.0
253  1915  10-14 Years        196.7         -44.0
372  1915  15-19 Years        330.9         -44.0
134  1915    5-9 Years        260.6         -44.0